import './Header.css';
import React from 'react';

// ** React.memo: 메모이제이션
// => 컴포넌트의 불필요한 리랜더링 방지 (최적화)
//    부모컴포넌트의 영향에서 벗어나 마운트시에만 랜더링 됨
// => React.memo(메모이제이션 하려는 컴포넌트)
//    인자로 전달된 컴포넌트를 메모이제이션 된 컴포넌트로 return
// => 적용전: 부모 컴포넌트인 App 이 리랜더링 되면 무조건 리랜더링 됨
// => 적용후: 마운트시에만 랜더링 됨.

 function Header() {
  console.log(`** Header Update !!! **`);
  return (
    <div>
      <h3>📅 오늘은 { new Date().toLocaleDateString() }</h3>
      {/* => 윈도우 이모지 : "윈도우 ."  누르면 표시됨 
          => toDateString(), toLocaleDateString(): 날짜를 문자열로     */}
    </div>
  ); //return
} //Header

//=> React.memo 로 감싸기 전 후 비교-
//    todo 에 변화가 일어나는 입력/수정/삭제 실행 후 출력 비교
//=> React.memo 로 감싸서 리턴되는 (재탄생 Header)컴포넌트를 export 해야함
export default React.memo(Header);